tutorial/lagrangian/icoMesoScaleCouplingFoam/spoutBed/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

vertices
(
    (0 0 0)
    (0.04 0 0)
    (0.04 0.7 0)
    (0 0.7 0)
    (0 0 6)
    (0.04 0 6)
    (0.04 0.7 6)
    (0 0.7 6)

    (0 0.8 0)
    (0.04 0.8 0)
    (0.04 1.5 0)
    (0 1.5 0)
    (0 0.8 6)
    (0.04 0.8 6)
    (0.04 1.5 6)
    (0 1.5 6)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (1 7 30) simpleGrading (1 1 1)
    hex (3 2 9 8 7 6 13 12) (1 1 30) simpleGrading (1 1 1)
    hex (8 9 10 11 12 13 14 15) (1 7 30) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    outlet
    {
        type wall;
        faces
        (
            (4 5 6 7)
            (7 6 13 12)
            (12 13 14 15)
        );
    }
    inlet
    {
        type wall;
        faces
        (
            (3 2 9 8)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (0 4 5 1)
            (0 1 2 3)
            (11 15 14 10)
            (8 9 10 11)
        );
    }
    
    emptyWalls
    {
        type empty;
        faces
        (
            (0 4 7 3)
            (2 6 5 1)
            (3 7 12 8)
            (2 6 13 9)
            (8 12 15 11)
            (10 14 13 9)
        );
    }   
);

mergePatchPairs
(
);

// ************************************************************************* //
