tutorial/lagrangian/icoMesoScaleCouplingFoam/spoutBed/constant/kinematicCloudPositions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       vectorField;
    object      kinematicCloudPositions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


(
(0.002 0.002 0.002)
(0.002 0.006 0.002)
(0.002 0.01 0.002)
(0.002 0.014 0.002)
(0.002 0.018 0.002)
(0.002 0.022 0.002)
(0.002 0.026 0.002)
(0.002 0.03 0.002)
(0.002 0.034 0.002)
(0.002 0.038 0.002)
(0.002 0.042 0.002)
(0.002 0.046 0.002)
(0.002 0.05 0.002)
(0.002 0.054 0.002)
(0.002 0.058 0.002)
(0.002 0.062 0.002)
(0.002 0.066 0.002)
(0.002 0.07 0.002)
(0.002 0.074 0.002)
(0.002 0.078 0.002)
(0.002 0.082 0.002)
(0.002 0.086 0.002)
(0.002 0.09 0.002)
(0.002 0.094 0.002)
(0.002 0.098 0.002)
(0.002 0.102 0.002)
(0.002 0.106 0.002)
(0.002 0.11 0.002)
(0.002 0.114 0.002)
(0.002 0.118 0.002)
(0.002 0.002 0.006)
(0.002 0.006 0.006)
(0.002 0.01 0.006)
(0.002 0.014 0.006)
(0.002 0.018 0.006)
(0.002 0.022 0.006)
(0.002 0.026 0.006)
(0.002 0.03 0.006)
(0.002 0.034 0.006)
(0.002 0.038 0.006)
(0.002 0.042 0.006)
(0.002 0.046 0.006)
(0.002 0.05 0.006)
(0.002 0.054 0.006)
(0.002 0.058 0.006)
(0.002 0.062 0.006)
(0.002 0.066 0.006)
(0.002 0.07 0.006)
(0.002 0.074 0.006)
(0.002 0.078 0.006)
(0.002 0.082 0.006)
(0.002 0.086 0.006)
(0.002 0.09 0.006)
(0.002 0.094 0.006)
(0.002 0.098 0.006)
(0.002 0.102 0.006)
(0.002 0.106 0.006)
(0.002 0.11 0.006)
(0.002 0.114 0.006)
(0.002 0.118 0.006)
(0.002 0.002 0.01)
(0.002 0.006 0.01)
(0.002 0.01 0.01)
(0.002 0.014 0.01)
(0.002 0.018 0.01)
(0.002 0.022 0.01)
(0.002 0.026 0.01)
(0.002 0.03 0.01)
(0.002 0.034 0.01)
(0.002 0.038 0.01)
(0.002 0.042 0.01)
(0.002 0.046 0.01)
(0.002 0.05 0.01)
(0.002 0.054 0.01)
(0.002 0.058 0.01)
(0.002 0.062 0.01)
(0.002 0.066 0.01)
(0.002 0.07 0.01)
(0.002 0.074 0.01)
(0.002 0.078 0.01)
(0.002 0.082 0.01)
(0.002 0.086 0.01)
(0.002 0.09 0.01)
(0.002 0.094 0.01)
(0.002 0.098 0.01)
(0.002 0.102 0.01)
(0.002 0.106 0.01)
(0.002 0.11 0.01)
(0.002 0.114 0.01)
(0.002 0.118 0.01)
(0.002 0.002 0.014)
(0.002 0.006 0.014)
(0.002 0.01 0.014)
(0.002 0.014 0.014)
(0.002 0.018 0.014)
(0.002 0.022 0.014)
(0.002 0.026 0.014)
(0.002 0.03 0.014)
(0.002 0.034 0.014)
...
)

// ************************************************************************* //
